{
  "episode": 15,
  "title": "Dinner Date",
  "date": "2025-09-11",
  "checkpoints": [
    {
      "id": 0,
      "episode": 15,
      "title": "Episode Cover",
      "backstory": "Episode 15 was about balance. The day started quietly, a grind at home, finally hitting publish on Episode 13 in the new card-swipe format. Sunlight broke through, leading to rooftop stillness and meditation. Work crept in with a sync call to Europe, but the night was for connection.\n\nDinner with Nann at AVA Brasserie brought conversation that outweighed the food, and persistence paid off at Tichuca — not for the rooftop itself (a tourist trap), but for the dialogue it framed. The night closed on a first: Bangkok's train system. At Nana station, paths split, a hug said goodbye, and the rails carried you home.\n\nThe mission wasn't flashy, but it was full: building, balancing, connecting, moving, and closing with rest.",
      "image": "2025/episode-15/cover.png"
    },
    {
      "id": 1,
      "episode": 15,
      "title": "Home Base Build",
      "backstory": "The morning wasn't about running the streets — it was about running code. Hours at the desk, tinkering, refactoring, until the new episode structure finally clicked. Now Urban Runner doesn't just look like a blog; it feels like a game. The swipeable cards echo the way checkpoints are lived: one decision, one flick, one moment at a time. Hitting *publish* wasn't just uploading a story — it was leveling up the entire system.\n\nAnd inside the game, you can see it: **Episode 13 – Bangkok Green Lung** (https://paulvisciano.github.io/moments/urban-runner-episode-13-2025-09-09) went live, published from within Episode 15 itself. The runner builds the world while also playing it — a recursive loop where reality and the game merge.",
      "image": "2025/episode-15/cp-1.png"
    },
    {
      "id": 2,
      "episode": 15,
      "title": "Rooftop Reset",
      "backstory": "The sun finally broke through Bangkok's clouds, and the rooftop became a sanctuary. Half an hour stretched into something more: warmth on the skin, eyes closed, body heavy with rest. By the pool, a meditation soundtrack played — waves of sound carrying the mind further away from the grind. Not just rest, but reset. A checkpoint of sunlight, stillness, and subtle healing.",
      "image": "2025/episode-15/cp-2.png"
    },
    {
      "id": 3,
      "episode": 15,
      "title": "Global Sync",
      "backstory": "Back inside, back online. The glow of the laptop shifted from creative grind to professional sync. One screen in Bangkok, another somewhere in Europe — time zones bending so that work could meet in the middle. The rhythm of rooftop calm gave way to conversation, tasks, and strategy. A reminder that while Urban Runner moves through streets, the other game — work — never stops.",
      "image": "2025/episode-15/cp-3.png"
    },
    {
      "id": 4,
      "episode": 15,
      "title": "Dinner with Nann",
      "backstory": "You and Nann had only started chatting last week, but the vibe clicked quickly enough that she suggested meeting before her trip. The spot: AVA Brasserie, a polished but overpriced restaurant on the 4th floor of the InterContinental. The plates were fancy, the atmosphere sleek, but in Bangkok terms it hardly justified the cost — especially knowing better meals exist on the street for a fraction. Still, this wasn't about value for money, it was about value in the moment. You picked up the bill, and conversation flowed with surprising ease, breaking the ice over food that was more set dressing than substance.",
      "image": "2025/episode-15/cp-4.png"
    },
    {
      "id": 5,
      "episode": 15,
      "title": "Rooftop Ascent",
      "backstory": "<p>Tichuca Rooftop Bar sits sky‑high on the <strong>46th floor of the T‑One Building</strong> on Soi Sukhumvit 40 in Khlong Toei district. Opened in late 2020, this jungle-themed rooftop bar has quickly become one of Bangkok's most Instagram-worthy destinations, with its signature LED-lit \"tree\" that dominates the space and changes colors throughout the night.</p>\n\n<p>This was my <strong>third attempt</strong> to get in: first I came too late (doors stop admitting after midnight on weekdays, 1:30 AM on weekends), second time the crowd was overwhelming, and now, finally, all the stars aligned. The entry process feels more like navigating a theme‑park ride than a bar, but once you reach the rooftop, the payoff is extraordinary.</p>\n\n<h3 style=\"color: #ff6b35; margin: 25px 0 15px 0; font-size: 1.2rem; border-bottom: 2px solid #ff6b35; padding-bottom: 8px;\">Overview</h3>\n<p><strong>Jungle-themed rooftop bar, with a design almost as impressive as the views.</strong> The LED tree is what puts Tichuca in a different league. Looming over the bar, it can bathe the entire place in one color or light up in luminescent pastels.</p>\n\n<h3 style=\"color: #ff6b35; margin: 25px 0 15px 0; font-size: 1.2rem; border-bottom: 2px solid #ff6b35; padding-bottom: 8px;\">View</h3>\n<p>Panoramic views over the Bangkok skyline. The jungle-themed rooftop stretches over three floors with fantastic views over Bangkok.</p>\n\n<h3 style=\"color: #ff6b35; margin: 25px 0 15px 0; font-size: 1.2rem; border-bottom: 2px solid #ff6b35; padding-bottom: 8px;\">Menu</h3>\n<ul style=\"margin: 10px 0; padding-left: 20px;\">\n  <li><strong>Cosmo Mary:</strong> 240 baht - hybrid Cosmopolitan & Bloody Mary</li>\n  <li><strong>Yuzu Colada:</strong> 260 baht - piña colada with Japanese citrus</li>\n  <li><strong>Coco Spritzer:</strong> 260 baht - coconut water & jackfruit blend</li>\n  <li><strong>Berries Cold Brew Tonic:</strong> 240 baht - coffee-infused cocktail</li>\n</ul>\n\n<h3 style=\"color: #ff6b35; margin: 25px 0 15px 0; font-size: 1.2rem; border-bottom: 2px solid #ff6b35; padding-bottom: 8px;\">Details</h3>\n<div style=\"background: rgba(255,255,255,0.05); padding: 15px; border-radius: 6px; margin: 15px 0;\">\n  <p style=\"margin: 5px 0;\"><strong>Address:</strong> T-One Building, 8 Phra Khanong, Khlong Toei, Bangkok 10110</p>\n  <p style=\"margin: 5px 0;\"><strong>Opening Hours:</strong> Mon-Thu: 5:00 PM - 12:00 AM | Fri-Sat: 5:00 PM - 1:30 AM | Sun: 5:00 PM - 12:00 AM</p>\n  <p style=\"margin: 5px 0;\"><strong>Contact:</strong> +66 65 878 5562 | tichuca.bkk@gmail.com</p>\n  <p style=\"margin: 5px 0;\"><strong>Dress Code:</strong> Casual</p>\n</div>\n\n<h3 style=\"color: #ff6b35; margin: 25px 0 15px 0; font-size: 1.2rem; border-bottom: 2px solid #ff6b35; padding-bottom: 8px;\">Why Visit</h3>\n<p>For impressive sips with spectacular 360° views and one of Bangkok's most unique rooftop experiences. The atmosphere is pure magic: panoramic city views, warm jungle lighting, lush plants and that mesmerizing LED tree glowing beneath the night sky.</p>\n\n<p>The crowd is stylish, photo‑ready, expecting spectacle. You and Nann found a table in the back, and the people‑watching, the conversation, and the skyline made it worthwhile — not because it's the most exclusive or the rarest, but because the setting amplified the moment. For someone who usually avoids pretentious rooftop hype, Tichuca felt mostly earned this time.</p>\n\n<div style=\"margin: 25px 0; padding-top: 15px; border-top: 1px solid rgba(255,255,255,0.2); display: flex; gap: 12px; flex-wrap: wrap; justify-content: center;\">\n  <a href=\"https://www.instagram.com/tichuca.bkk/\" target=\"_blank\" rel=\"noopener\" class=\"info-link instagram-link\">\n    <span class=\"link-icon\">📸</span>\n    <span class=\"link-text\">Instagram</span>\n  </a>\n  <a href=\"https://www.google.com/maps/search/?api=1&query=T-One+Building+8+Phra+Khanong+Khlong+Toei+Bangkok+10110\" target=\"_blank\" rel=\"noopener\" class=\"info-link map-link\">\n    <span class=\"link-icon\">🗺️</span>\n    <span class=\"link-text\">Directions</span>\n  </a>\n  <a href=\"https://www.timeout.com/bangkok/bars/tichuca\" target=\"_blank\" rel=\"noopener\" class=\"info-link review-link\">\n    <span class=\"link-icon\">⭐</span>\n    <span class=\"link-text\">Review</span>\n  </a>\n</div>",
      "image": "2025/episode-15/cp-5.png"
    },
    {
      "id": 6,
      "episode": 15,
      "title": "First Train Ride",
      "backstory": "We walked together to the station, but that's where the paths split. She was heading one way, I was heading the other. Before parting, I hugged her, thanked her for dinner, and for nudging me to finally try Bangkok's train.\n\nThe station: **BTS Nana**, on the Sukhumvit Line. It sits right above Sukhumvit Road, in one of Bangkok's busiest nightlife districts. The elevated platform overlooks neon-lit streets packed with traffic, vendors, and bars — but above it all, the station feels strangely calm, suspended over the chaos. Access is via long staircases and escalators leading up from the street. Ticket machines here still use **stored-value Rabbit cards** or single-journey tokens, and bilingual signs make navigation easy for visitors.\n\nThe BTS runs every 3‑8 minutes during peak hours, usually until midnight. Nana connects north to Mo Chit and south toward Samrong, forming one of the spine routes of Bangkok. From here you can easily transfer to Asok for the MRT subway. The ride is smooth, quiet, and air-conditioned — a stark contrast to the humid heat of the streets below.\n\nIt was my first time stepping onto a Bangkok train — usually I walk or Grab my way across the city. From up here, though, the ride felt effortless. No gridlock, no honking horns, just the hum of the tracks and the skyline sliding by. The checkpoint wasn't just about transport; it was about closing one connection and opening a new path home.",
      "image": "2025/episode-15/cp-6.png"
    }
  ]
}